#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Jul  3 09:59:00 2019

@author: jsy
"""

"""
比较常用的正则表达式
"""
import re

'''由数字/大写字母/小写字母/标点符号组成，四种都必有，8位以上'''
p=re.compile('(?=^.{8,}$)(?=.*\d)(?=.*\W+)(?=.*[A-Z])(?=.*[a-z])(?!.*\n).*$')
s='asdfA123#'
c=p.findall(s)
print(c) #输出：['asdfA123#']


'''\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*'''
'''邮箱表示方法'''
p=re.compile('\w+@\w+\.\w+')
s='123456jsy@gmail.com'
print(p.findall(s)) #输出：['123456jsy@gmail.com'] 

'''大陆固定电话'''
p=re.compile('(?:\d{4}-|\d{3}-)(?:\d{8}|\d{7})')
s='0716-4837566'
print(p.findall(s)) #输出：['0716-4837566']

'''大陆手机号'''
p=re.compile('1\d{10}')
s='12345678910'
print(p.findall(s)) #输出：['12345678910']

'''表示所有的实数'''
p=re.compile('-?\d*\.?\d+')
s='123 -123 0.123 12.03'
print(p.findall(s)) #输出：['123', '-123', '0.123', '12.03']


'''中文数字表示识别'''
digit='(?:[两一二三四五六七八九十百千万]+亿)?零?(?:[两一二三四五六七八九十百千]+万)?零?(?:[两一二三四五六七八九十百][千])?零?(?:[两一二三四五六七八九十][百])?零?(?:[两一二三四五六七八九]?[十])?零?(?:[两一二三四五六七八九])?'
digit2='[一二三四五六七八九两十]+[十百千万零]*[一二三四五六七八九两半]?'   #存在不能匹配的情况，例如五千三百一十二
p=re.compile('(?=.{1,}$)'+digit)
s='五十二，一千零一，五百万，五千三百一十二,一'
c=p.findall(s)
print(c) #输出['五十二', '', '一千零一', '', '五百万', '', '五千三百一十二', '', '一']
#去掉匹配中的空串
c=[i for i in c if i!='' ]
print(c)



